/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   connect_nodes.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mai <mai@student.42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/19 22:09:56 by mai               #+#    #+#             */
/*   Updated: 2021/11/19 22:10:19 by mai              ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../push_swap.h"

// node①のnextをnode②にし、node②のprevをnode①にする
void	connect_nodes(t_node *node_1, t_node *node_2)
{
	node_1->next = node_2;
	node_2->prev = node_1;
}
